"""1. Увеличте все элементы
следующей коллекции на 1"""

int_list = [1,2,"3",4,5,6,7,"5", "100"]
result_list = ...


"""2. Сложите все элементы
предыдущей коллекции(result_list)"""


"""3. Напишите функцию, которая получает
список элементов(аргументом может быть
список как int_list из задания 1). Найдите
сумму всех элементов. И верните как результат
строку:
"Сумма элементов {все элементы списка через запятую} равно {сумма всех элементов}"
"""

...

"""4. Перепишите предыдущую функцию,
чтобы она принимала не лист, а
элементы поотдельности. Количество аргументов
должно быть неограниченно."""

...

"""5. Напишите функцию, которая будет
последовательно перемножать элементы
2х коллекций.
Например a=[1,2,3], b=[3,4,5], то
результат функции - [3, 8, 15].
Предпологается, что коллекции имеют
одинаковое количество элементов."""

...